/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memcpy.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: anklochk <anklochk@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/01/06 13:03:29 by anklochk          #+#    #+#             */
/*   Updated: 2025/01/22 22:27:49 by anklochk         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	*ft_memcpy(void *dst, const void *src, size_t n)
{
	unsigned char	*d;
	unsigned char	*s;

	d = (unsigned char *)dst;
	s = (unsigned char *)src;
	if (!dst && !src)
		return (dst);
	while (n--)
		*d++ = *s++;
	return (dst);
}
	// чтобы уникнуть ошибки когда память в двух указателях пуста
	// Memmove Предназначена только для копирования данных
	//между непересекающимися областями памяти.
	// Если указатели перекрываются, результат будет неопределенным.
	// Fast, выполняет проверок на перекрытие.