/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   check_map.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: anastasiya <anastasiya@student.42.fr>      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/17 15:46:40 by anastasiya        #+#    #+#             */
/*   Updated: 2025/06/10 16:52:59 by anastasiya       ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

// содержит ли карта одного игрока, один вызход и являетсся ли она валидной 
// читает файл построчно через get_next_line
int parse_map(int file_path)
{
    int	fd = open(file_path, O_RDONLY);
    int line;
    
    while(!line)
    {
        read map
    }
}